//не знаю как исправить проблему с персонажем, он не двигается
#include <iostream>
#include <conio.h>
using namespace std;

int main() {
  srand(time(0));
  int m = 10; 
  int n = 15; 
  char labyrint[m][n] = {
    {'#', '#', '#', '#', '#', '#', '#', '#', '#', '#', '#', '#', '#', '#', '#'},
    {'#', '.', '.', '.', '#', '.', '.', '.', '.', '.', '.', '.', '.', '.', '#'},
    {'#', '#', '#', '#', '#', '#', '#', '#', '#', '.', '#', '#', '#', '.', '#'},
    {'#', '.', '.', '#', '.', '.', '.', '.', '.', '.', '.', '.', '.', '.', '#'},
    {'#', '#', '.', '#', '#', '#', '.', '#', '#', '#', '#', '#', '#', '#', '#'},
    {'#', '.', '.', '.', '.', '.', '.', '#', '.', '.', '.', '.', '.', '.', '#'},
    {'#', '.', '#', '#', '#', '#', '.', '#', '#', '#', '.', '#', '#', '.', '#'},
    {'#', '.', '.', '.', '.', '.', '.', '.', '.', '.', '.', '.', '#', '.', '#'},
    {'#', '.', '#', '#', '.', '#', '#', '#', '#', '#', '#', '#', '#', '.', '#'},
    {'#', '#', '#', '#', '#', '#', '#', '#', '#', '#', '#', '#', '#', '#', '#'} };
int x = 1;
  int y = 1;
int exitX = n - 1;
int exitY = m - 1;
while (true) {
  system("cls");
  for (int i = 0; i < m; i++) {
    for (int j = 0; j < n; j++) {
      if (i == y && j == x) {
        cout << 'P';
      } else {
        cout << labyrint[i][j];
          
       }
    }
     cout << "\n";
   }
  char key = cin.get();
  switch (key) {
    case 'w':
      if (labyrint[y - 1][x] != '#') {
        y--;
       }
       break;
     case 's':
     if (labyrint[y + 1][x] != '#') {
        y++;
      }
      break;
     case 'a':
      if (labyrint[y][x - 1] != '#') {
         x--;
       }
       break;
    case 'd':
       if (labyrint[y][x + 1] != '#') {
         x++;
       }
       break;
     case 27:

       return 0;
   }
   if (x == exitX && y == exitY) {
     cout << "победа - найден выход" << "\n";
     break;
   }
 }
 return 0;
}